package com.usky.sms.constant;

public interface MessageCodeConstant {
	
	/** 默认 */
	String MSG_CODE_DEFAULT = "-100000001";
	
	/** 无法识别的请求内容！ */
	String MSG_CODE_101000001 = "-101000001";
	
	/** 未知错误！请联系系统管理员！ */
	String MSG_CODE_101000002 = "-101000002";
	
	/** 无访问权限！ */
	String MSG_CODE_101000003 = "-101000003";
	
	/** 系统升级中，已更新{0}！ */
	String MSG_CODE_101000004 = "-101000004";
	
	/** 未找到实体对象！ */
	String MSG_CODE_101000005 = "-101000005";
	
	/** 未指定对象类型！ */
	String MSG_CODE_101000006 = "-101000006";
	
	/** 未指定实体对象！ */
	String MSG_CODE_101000007 = "-101000007";
	
	/** 未指定数据项！ */
	String MSG_CODE_101000008 = "-101000008";
	
	/** 无匹配的实体对象！ */
	String MSG_CODE_101000009 = "-101000009";
	
	/** 未指定实体对象或指定的实体对象无效！ */
	String MSG_CODE_101000010 = "-101000010";
	
	/** 您没有执行操作的权限 */
	String MSG_CODE_101000011 = "-101000011";
	
	/** 查询失败！ */
	String MSG_CODE_101001001 = "-101001001";
	
	/** 操作失败！错误详情{0} */
	String MSG_CODE_101001002 = "-101001002";
	
	/** 导出失败！{0} */
	String MSG_CODE_101001003 = "-101001003";
	
	/** 导入数据表的字段数与预置的字段数不一致！数据表的字段数：{0}, 预置的字段数：{1} */
	String MSG_CODE_101001004 = "-101001004";
	
	/** 导入数据模板不正确！ */
	String MSG_CODE_101001005 = "-101001005";
	
	/** {0}不能为空！ */
	String MSG_CODE_101002001 = "-101002001";
	
	/** 参数{0}不能为空 */
	String MSG_CODE_101002003 = "-101002003";
	
	/** {0}已存在 */
	String MSG_CODE_101002004 = "-101002004";
	
	/** {0}类型已存在! */
	String MSG_CODE_101002005 = "-101002005";
	
	/** 字段[{0}]输入内容超出限制范围！ */
	String MSG_CODE_101002006 = "-101002006";
	
	/** 值[{0}]不是integer类型！ */
	String MSG_CODE_101002007 = "-101002007";
	
	/** 解析xml失败!\n{0} */
	String MSG_CODE_101002008 = "-101002008";
	
	/** 解析日期失败！{0} */
	String MSG_CODE_101002009 = "-101002009";
	
	/** 时间格式不正确！ */
	String MSG_CODE_101002010 = "-101002010";
	
	/** 状态[{0}]不存在! */
	String MSG_CODE_101002011 = "-101002011";
	
	/** 已存在相同的记录 */
	String MSG_CODE_101002012 = "-101002012";
	
	/** 不支持指定的查询字段[{0}] */
	String MSG_CODE_101002013 = "-101002013";
	
	/** 此条应用程序导航栏记录已存在！ */
	String MSG_CODE_101002014 = "-101002014";
	
	/** 可能性没有设置！ */
	String MSG_CODE_101002015 = "-101002015";
	
	/** 色块没有设置！ */
	String MSG_CODE_101002016 = "-101002016";
	
	/** 数据更新失败！ */
	String MSG_CODE_101002017 = "-101002017";
	
	/** 请选择年份！ */
	String MSG_CODE_101002018 = "-101002018";
	
	/** 年份为必选项! */
	String MSG_CODE_101002019 = "-101002019";
	
	/** 请选择发生日期！ */
	String MSG_CODE_101002020 = "-101002020";
	
	/** 请选择结束时间！ */
	String MSG_CODE_101002021 = "-101002021";
	
	/** 请选择开始时间！ */
	String MSG_CODE_101002022 = "-101002022";
	
	/** 请输入正确的开始日期和结束日期！ */
	String MSG_CODE_101002023 = "-101002023";
	
	/** 请选择验证人！ */
	String MSG_CODE_101002024 = "-101002024";
	
	/** 请选择一个安监机构！ */
	String MSG_CODE_101002025 = "-101002025";
	
	/** 请选择一个信息类型！ */
	String MSG_CODE_101002026 = "-101002026";
	
	/** 请选择至少一个人员！ */
	String MSG_CODE_101002027 = "-101002027";
	
	/** 请选择至少一个项目主管！ */
	String MSG_CODE_101002028 = "-101002028";
	
	/** 禁用状态下不能发布！ */
	String MSG_CODE_101002029 = "-101002029";
	
	/** 未发布状态下不能禁用！ */
	String MSG_CODE_101002030 = "-101002030";
	
	/** 严重性没有设置！ */
	String MSG_CODE_101002031 = "-101002031";
	
	/** 缺少参数！ */
	String MSG_CODE_101002032 = "-101002032";
	
	/** 报表不存在！ */
	String MSG_CODE_101002033 = "-101002033";
	
	/** SMTP邮件服务器已被禁用！ */
	String MSG_CODE_102000001 = "-102000001";
	
	/** 没有TOKEN或TICKET！ */
	String MSG_CODE_103000001 = "-103000001";
	
	/** 会话已超时，请重新登陆！ */
	String MSG_CODE_103000002 = "-103000002";
	
	/** 登录失败，密码不正确！ */
	String MSG_CODE_103000003 = "-103000003";
	
	/** 会话过期  */
	String MSG_CODE_103000004 = "-103000004";
	

	/** 用户名[{0}]不存在！ */
	String MSG_CODE_104000001 = "-104000001";
	
	/** 该用户不存在于本系统中！ */
	String MSG_CODE_104000002 = "-104000002";
	
	/** 此人已存在于列表中，请勿重复添加！ */
	String MSG_CODE_104000003 = "-104000003";
	
	/** 该用户无可用角色！ */
	String MSG_CODE_104000004 = "-104000004";
	

	/** 用户组[{0}]已存在! */
	String MSG_CODE_105000001 = "-105000001";
	
	/** 用户组{0}没有配置人员！ */
	String MSG_CODE_105000002 = "-105000002";
	

	/** {0}下的{1}角色没有配置人员！ */
	String MSG_CODE_106000001 = "-106000001";
	
	/** 角色[{0}]不存在! */
	String MSG_CODE_106000002 = "-106000002";
	
	/** 角色里没有{0}角色 ！ */
	String MSG_CODE_106000003 = "-106000003";
	
	/** 角色不存在！ */
	String MSG_CODE_106000004 = "-106000004";
	

	/** 组织名不能为空！ */
	String MSG_CODE_107000001 = "-107000001";
	
	/** 组织编号不能为空！ */
	String MSG_CODE_107000002 = "-107000002";
	
	/** 上级组织不能为空！ */
	String MSG_CODE_107000003 = "-107000003";

	/** 不可重复添加相同的组织！ */
	String MSG_CODE_107000004 = "-107000004";

	/** 组织ID不能为空！ */
	String MSG_CODE_107000005 = "-107000005";

	/** 此组织编号已存在！ */
	String MSG_CODE_107000006 = "-107000006";

	/** 该组织[ID:{0}]不存在！ */
	String MSG_CODE_107000007 = "-107000007";

	/** 该组织未关联任何安监机构！ */
	String MSG_CODE_107000008 = "-107000008";

	/** 该组织已存在！ */
	String MSG_CODE_107000009 = "-107000009";

	/** 所属组织不能为当前组织或当前组织的下级组织！ */
	String MSG_CODE_107000010 = "-107000010";


	/** 无访问权限的角色！ */
	String MSG_CODE_108000001 = "-108000001";


	/** 安监机构[ID:{0}]不存在！ */
	String MSG_CODE_109000001 = "-109000001";

	/** 已存在相同的单位！ */
	String MSG_CODE_109000002 = "-109000002";

	/** 已存在相同名称或键值的安全机构！ */
	String MSG_CODE_109000003 = "-109000003";

	/** 没有可选择的安监机构！ */
	String MSG_CODE_109000004 = "-109000004";


	/** 自定义字段[{0}]不存在！ */
	String MSG_CODE_110000001 = "-110000001";

	/** 系统中不存在名为[{0}]的自定义字段 */
	String MSG_CODE_110000002 = "-110000002";

	/** 已存在相同名称的自定义字段！ */
	String MSG_CODE_110000003 = "-110000003";


	/** 已存在相同名称的过滤器！ */
	String MSG_CODE_111000001 = "-111000001";


	/** 系统中不存在匿名用户，无法匿名上报员工安全报告！ */
	String MSG_CODE_112000001 = "-112000001";

	/** 编号[{0}]的安全信息还没有完成 */
	String MSG_CODE_112000002 = "-112000002";

	/** 任务分配的对应处理角色未设置！ */
	String MSG_CODE_112000003 = "-112000003";

	/** 没有可选择的安全信息类型！ */
	String MSG_CODE_112000004 = "-112000004";

	/** 查询失败!过滤器规则[{0}] */
	String MSG_CODE_112000005 = "-112000005";


	/** 获取{0}以后的数据失败! */
	String MSG_CODE_112001001 = "-112001001";

	/** 配置文件中没有配置获取机长报告接口的地址! */
	String MSG_CODE_112001002 = "-112001002";


	/** 第{0}行的上报单位、主题、系统分类、事件描述和事件等级必填！ */
	String MSG_CODE_112002001 = "-112002001";

	/** 上报单位[{0}]不存在！ */
	String MSG_CODE_112002002 = "-112002002";

	/** 信息类型[{0}]的下发类型没有配置! */
	String MSG_CODE_112002003 = "-112002003";

	/** 安全信息的类型[{0}]不存在！ */
	String MSG_CODE_112002004 = "-112002004";

	/** 安全信息的优先级[{0}]不存在！ */
	String MSG_CODE_112002005 = "-112002005";

	/** 安全信息的状态[{0}]不存在！ */
	String MSG_CODE_112002006 = "-112002006";


	/** 获取{0}的deviceToken失败! */
	String MSG_CODE_112003001 = "-112003001";


	/** 安全信息类型[ID:{0}]不存在! */
	String MSG_CODE_113000001 = "-113000001";

	/** 系统中不存在名为[{0}]的信息类型！ */
	String MSG_CODE_113000002 = "-113000002";
	
	/** 系统中不存在名为[{0}]的安监机构！ */
	String MSG_CODE_113000003 = "-113000003";


	/** 该信息安全级别配置已存在！ */
	String MSG_CODE_114000001 = "-114000001";


	/** 系统分类[{0}]不存在！ */
	String MSG_CODE_115000001 = "-115000001";


	/** 不能添加超过4个差错！ */
	String MSG_CODE_116000001 = "-116000001";

	/** 不能添加超过4个威胁！ */
	String MSG_CODE_116000002 = "-116000002";


	/** 威胁(主详)[{0}]不存在！ */
	String MSG_CODE_117000001 = "-117000001";

	/** 威胁(次详)[{0}]不存在！ */
	String MSG_CODE_117000002 = "-117000002";

	/** 威胁(次详)存在的情况下请输入威胁(主详)！ */
	String MSG_CODE_117000003 = "-117000003";

	/** 待添加的威胁中有已存在的威胁！ */
	String MSG_CODE_117000004 = "-117000004";


	/** 差错(主详)[{0}]不存在！ */
	String MSG_CODE_118000001 = "-116000001";

	/** 差错(次详)[{0}]不存在！ */
	String MSG_CODE_118000002 = "-116000002";

	/** 差错(次详)存在的情况下请输入差错(主详)！ */
	String MSG_CODE_118000003 = "-116000003";

	/** 待添加的差错中有已存在的差错！ */
	String MSG_CODE_118000004 = "-118000004";


	/** 操作失败：已存在控制措施 */
	String MSG_CODE_119000001 = "-119000001";


	/** 不能删除非草稿的行动项！ */
	String MSG_CODE_120000001 = "-120000001";

	/** 行动项[ID:{0}]不存在 */
	String MSG_CODE_120000002 = "-120000002";

	/** 行动项[ID:{0}]未设置验证人 */
	String MSG_CODE_120000003 = "-120000003";


	/** 事件等级（新）[{0}]不存在！ */
	String MSG_CODE_121000001 = "-121000001";


	/** 事件类型[{0}]不存在！ */
	String MSG_CODE_122000001 = "-122000001";


	/** 存在重复的手册条款！ */
	String MSG_CODE_123000001 = "-123000001";

	/** 事件等级（新）[{0}]对应的对应条款不存在！ */
	String MSG_CODE_123000002 = "-123000002";


	/** 后果[{0}]不存在！ */
	String MSG_CODE_124000001 = "-124000001";


	/** 不安全状态[{0}]不存在！ */
	String MSG_CODE_125000001 = "-125000001";


	/** 获取{0}的机场信息失败 */
	String MSG_CODE_126000001 = "-126000001";

	/** 机场代码[{0}]对应的机场信息不存在 */
	String MSG_CODE_126000002 = "-126000002";

	/** 获取机场：{0}的天气信息失败 */
	String MSG_CODE_126000003 = "-126000003";


	/** 获取飞机信息失败, 机号:{0} */
	String MSG_CODE_127000001 = "-127000001";


	/** 机型类型为{0}、机型系列为{1}、机型厂商为{2}的记录已存在！ */
	String MSG_CODE_128000001 = "-128000001";


	/** 航班id[{0}]对应的航班信息不存在 */
	String MSG_CODE_129000001 = "-129000001";

	/** 航班号[{0}]对应的航班不存在！ */
	String MSG_CODE_129000002 = "-129000002";

	/** 获取航班信息失败, id:{0} */
	String MSG_CODE_129000003 = "-129000003";

	/** 已存在相同日期和航班的记录！ */
	String MSG_CODE_129000004 = "-129000004";


	/** 飞行阶段(新)[{0}]不存在！ */
	String MSG_CODE_130000001 = "-130000001";


	/** 条目标题不能为空！ */
	String MSG_CODE_131000001 = "-131000001";

	/** 所属章节不能为空！ */
	String MSG_CODE_131000002 = "-131000002";

	/** 所属章节不能为当前章节或当前章节的子章节！ */
	String MSG_CODE_131000003 = "-131000003";

	/** 所属章节[章节ID:{0}]不存在！ */
	String MSG_CODE_131000004 = "-131000004";

	/** 目录类型[{0}]不存在! */
	String MSG_CODE_131000005 = "-131000005";

	/** 所属目录不存在！请先创建该目录！ */
	String MSG_CODE_131000006 = "-131000006";


	/** 没有配置的保存路径！ */
	String MSG_CODE_132000001 = "-132000001";

	/** 没有配置上传文件的保存路径！ */
	String MSG_CODE_132000002 = "-132000002";

	/** 文件名重复! */
	String MSG_CODE_132000003 = "-132000003";

	/** 文件类型[{0}]不存在! */
	String MSG_CODE_132000004 = "-132000004";

	/** 文件[{0}]导入数据失败！ */
	String MSG_CODE_132000005 = "-132000005";

	/** 文件[{0}]解析失败！ */
	String MSG_CODE_132000006 = "-132000006";

	/** 该对象无附件功能！ */
	String MSG_CODE_132000007 = "-132000007";

	/** 附件上传失败！ */
	String MSG_CODE_132000008 = "-132000008";


	/** 字典里没有一级审计主管参数！ */
	String MSG_CODE_133000001 = "-133000001";

	/** 字典里没有一级审计经理参数！ */
	String MSG_CODE_133000002 = "-133000002";

	/** 字典里没有一级审计员参数！ */
	String MSG_CODE_133000003 = "-133000003";

	/** 字典里没有二级审计员参数！ */
	String MSG_CODE_133000004 = "-133000004";

	/** 字典里没有三级审计员参数！ */
	String MSG_CODE_133000005 = "-133000005";

	/** 系统字典中没有配置类型为[{0}],key为[{1}]的记录 */
	String MSG_CODE_133000006 = "-133000006";

	/** 系统字典中没有配置类型为[{0}],名称为[{1}]的记录！ */
	String MSG_CODE_133000007 = "-133000007";

	/** 字典中类型为:审计参数,名称为:公司级安监机构的记录的value值不是有效的数字！ */
	String MSG_CODE_133000008 = "-133000008";


	/** 未指定Solr实例！ */
	String MSG_CODE_134000001 = "-134000001";

	/** 更新solr失败！从solr中获取{0}[id:{1}]的信息失败！ */
	String MSG_CODE_134000002 = "-134000002";


	/** 对应的考核内容不能为空！ */
	String MSG_CODE_135000001 = "-135000001";

	/** 对应的考核内容不存在！ */
	String MSG_CODE_135000002 = "-135000002";

	/** 该考核内容不存在! */
	String MSG_CODE_135000003 = "-135000003";

	/** 安全评审条目不存在,请联系管理员创建该条目！ */
	String MSG_CODE_135000004 = "-135000004";

	/** 对应的评分标准不能为空！ */
	String MSG_CODE_135000005 = "-135000005";

	/** 考核内容ID不能为空! */
	String MSG_CODE_135000006 = "-135000006";

	/** 评审单[ID:{0}]不存在! */
	String MSG_CODE_135000007 = "-135000007";

	/** 评审单[ID:{0}已被审核,不能进行更新操作！ */
	String MSG_CODE_135000008 = "-135000008";

	/** {0}下没有设置评审管理员 */
	String MSG_CODE_135000009 = "-135000009";

	/** 该评审单已经被提交过了，不能再进行保存或提交操作！ */
	String MSG_CODE_135000010 = "-135000010";

	/** 此记录已被评审人:{0}打过分了! */
	String MSG_CODE_135000011 = "-135000011";

	/** 日常安全工作的状态[{0}]不存在！ */
	String MSG_CODE_135000012 = "-135000012";


	/** 输入的x值不是有效的数字！ */
	String MSG_CODE_135001001 = "-135001001";

	/** 表达式不能为空！ */
	String MSG_CODE_135001002 = "-135001002";

	/** 数学表达式不能为空！ */
	String MSG_CODE_135001003 = "-135001003";

	/** 表达式[{0}]无效！ */
	String MSG_CODE_135001004 = "-135001004";

	/** 最大值或最小值输入的不是实数！ */
	String MSG_CODE_135001005 = "-135001005";

	/** 最小值不能比最大值大！ */
	String MSG_CODE_135001006 = "-135001006";

	/** 左区间不能为空！ */
	String MSG_CODE_135001007 = "-135001007";

	/** 左区间不能比右区间大！ */
	String MSG_CODE_135001008 = "-135001008";

	/** 区间[{0}] 与 [{1}]重叠了 */
	String MSG_CODE_135001009 = "-135001009";


	/** 发送通知失败！错误信息：{0} */
	String MSG_CODE_136000001 = "-136000001";


	/** 接收人不存在！ */
	String MSG_CODE_137000001 = "-137000001";

	/** 发送订阅邮件失败！{0} */
	String MSG_CODE_137000002 = "-137000002";


	/** 推送消息失败！详情：{0} */
	String MSG_CODE_138000001 = "-138000001";


	/** {0}的工作流没有配置! */
	String MSG_CODE_139000001 = "-139000001";

	/** 流程处理人为空！ */
	String MSG_CODE_139000002 = "-139000002";

	/** 没有处理人，请联系管理员！ */
	String MSG_CODE_139000003 = "-139000003";

	/** 工作流服务[{0}]返回错误{1}：{2} */
	String MSG_CODE_139000004 = "-139000004";

	/** 工作流服务[{0}]返回的数据中没有[status]字段 */
	String MSG_CODE_139000005 = "-139000005";

	/** 工作流服务[{0}]执行失败，但是返回status为0，可能有函数return false前没有SetErrorMsg */
	String MSG_CODE_139000006 = "-139000006";

	/** 工作流服务[{0}]发生错误，但原因未知 */
	String MSG_CODE_139000007 = "-139000007";


	/** 已存在相同名称的工作流方案！ */
	String MSG_CODE_140000001 = "-140000001";


	/** 不存在审核状态是{0}的记录！ */
	String MSG_CODE_501000001 = "-501000001";

	/** 存在审核状态是{0}的记录！ */
	String MSG_CODE_501000002 = "-501000002";

	/** 不存在审计状态是{0}的记录！ */
	String MSG_CODE_501000003 = "-501000003";


	/** 审计计划类型[{0}]不存在! */
	String MSG_CODE_502000001 = "-502000001";


	/** 此工作单下没有检查单！ */
	String MSG_CODE_503000001 = "-503000001";

	/** {0}下已经有工作单了，操作无法完成！ */
	String MSG_CODE_503000002 = "-503000002";

	/** 该工作单的检查单已生成，不能被删除！ */
	String MSG_CODE_503000003 = "-503000003";

	/** 该工作单没有任何有问题的项目，无法生成整改单！ */
	String MSG_CODE_503000004 = "-503000004";

	/** 该工作单没有任何有问题的项目，无法生成整改通知单！ */
	String MSG_CODE_503000005 = "-503000005";

	/** 该审计报告没有有问题的项! */
	String MSG_CODE_503000006 = "-503000006";

	/** 还有{0}个工作单还没完成! */
	String MSG_CODE_503000007 = "-503000007";

	/** 级别不能为空! */
	String MSG_CODE_503000008 = "-503000008";

	/** 检查的级别[{0}]不存在! */
	String MSG_CODE_503000009 = "-503000009";

	/** 没有被审计单位! */
	String MSG_CODE_503000010 = "-503000010";

	/** 找不到相关的工作单！ */
	String MSG_CODE_503000011 = "-503000011";


	/** 编号请输入整数！ */
	String MSG_CODE_504000001 = "-504000001";


	/** 没有此检查单！ */
	String MSG_CODE_505000001 = "-505000001";

	/** 当前检查单缺失工作流实例！ */
	String MSG_CODE_505000002 = "-505000002";

	/** 请为此检查单添加检查项！ */
	String MSG_CODE_505000003 = "-505000003";

	/** {0}的检查单还没完成! */
	String MSG_CODE_505000004 = "-505000004";

	/** {0}的检查单还未下发! */
	String MSG_CODE_505000005 = "-505000005";

	/** {0}没有选择审计员！ */
	String MSG_CODE_505000006 = "-505000006";

	/** {0}已完成，不能再修改审计员了! */
	String MSG_CODE_505000007 = "-505000007";


	/** 整改联系人不能为空！ */
	String MSG_CODE_506000001 = "-506000001";

	/** 整改联系人的联系方式不能为空！ */
	String MSG_CODE_506000002 = "-506000002";

	/** 整改反馈的签批件未上传！ */
	String MSG_CODE_506000003 = "-506000003";

	/** 整改单状态[{0}]不存在! */
	String MSG_CODE_506000004 = "-506000004";


	/** 整改通知单类型[{0}]不存在! */
	String MSG_CODE_507000001 = "-507000001";

	/** 整改通知单来源类型[{0}]不存在! */
	String MSG_CODE_507000002 = "-507000002";

	/** 整改通知单状态[{0}]不存在! */
	String MSG_CODE_507000003 = "-507000003";

	/** 整改通知单日志类型[{0}]不存在! */
	String MSG_CODE_507000004 = "-507000004";

	/** 该整改通知单没有问题列表，不能下发！ */
	String MSG_CODE_507000005 = "-507000005";

	/** 责任单位为{0}的问题实例化工作流失败！错误详情：{1} */
	String MSG_CODE_507000006 = "-507000006";

	/** 下发未成功请重新下发！ */
	String MSG_CODE_507000007 = "-507000007";

	/** 发送整改通知单验证通过的通知失败！错误信息：{0} */
	String MSG_CODE_507000008 = "-507000008";


	/** 跟踪单状态[{0}]不存在! */
	String MSG_CODE_508000001 = "-508000001";

	/** 验证状态[{0}]不存在! */
	String MSG_CODE_508000002 = "-508000002";

	/** {0}的完成情况还未填写！ */
	String MSG_CODE_508000003 = "-508000003";

	/** 此项要点已存在！ */
	String MSG_CODE_508000004 = "-508000004";

	/** {0}的整改说明原因或整改措施或整改责任人未填写，无法提交！ */
	String MSG_CODE_508000005 = "-508000005";

	/** 存在审计状态不是{0}或{1}或{2}的记录！ */
	String MSG_CODE_508000006 = "-508000006";

	/** 存在审计状态不为{0}的记录！ */
	String MSG_CODE_508000007 = "-508000007";

	/** 存在审计状态是{0}的记录！ */
	String MSG_CODE_508000008 = "-508000008";

	/** 存在未进行审核的整改反馈记录! */
	String MSG_CODE_508000009 = "-508000009";

	/** {0}没有添加审计记录! */
	String MSG_CODE_508000010 = "-508000010";

	/** [{0}]检查项已添加！ */
	String MSG_CODE_508000011 = "-508000011";

	/** 存在未进行审核的整改问题记录! */
	String MSG_CODE_508000012 = "-508000012";

	/** 还有{0}项没有提交完成情况！ */
	String MSG_CODE_508000013 = "-508000013";

	/** 当前用户没有上传签批件，无法提交！ */
	String MSG_CODE_508000014 = "-508000014";

	/** 没有此审计结论！ */
	String MSG_CODE_508000015 = "-508000015";

	/** 您已不是这条验证项的验证人了 */
	String MSG_CODE_508000016 = "-508000016";

	/** 验证人不能为空！ */
	String MSG_CODE_508000017 = "-508000017";

	/** 必须要有至少一条问题进行跟踪验证！ */
	String MSG_CODE_508000018 = "-508000018";


	/** 审计信息类型[{0}]不存在! */
	String MSG_CODE_509000001 = "-509000001";

	/** 审计信息类型和工作流模板为必选项! */
	String MSG_CODE_509000002 = "-509000002";


	/** 没有找到当前使用审计库！ */
	String MSG_CODE_510000001 = "-510000001";


	/** 审计类型不能为空! */
	String MSG_CODE_511000001 = "-511000001";

	/** 没有选的专业! */
	String MSG_CODE_511000002 = "-511000002";
	
	/******************************luobin added**********************************/
	/**该航班已提交过机长报告*/
	String MSG_CODE_800000001 = "-800000001";
	/******************************luobin added**********************************/

}
